[
    {
        "Undergraduate": [
            {
                "collage_name": "Chuncheon Campus",
                "courses": [
                    {
                        "course_name": "Business Administration",
                        "course_description": "<p>Originally established in 1970 as Department of Business Administration, College of Business Administration began its path as the current major/department system in 1980 and has achieved impressive growth and development within a short period of time less than half a century. It is the result of devotion by all faculty, students and alumni to raise talented individuals who will play a pivotal role in development of the nation and region under the objective of 『cultivating talents with hands-on skills』 to practice the school's motto of 『”Sil-Sa-Gu-Si” (a Korean proverb meaning “to strive for pragmatism”)』.</p><p>Now College of Business Administration is dreaming a new leap and growth as an open university to the future and to the world beyond its geographical boundary as one of the Flagship Korean National Universities in the Gangwon region and metropolitan area. It obtained accreditation of business administration in the education field, and it promotes international exchanges, including student exchange programs, with universities around the world. The department also offers various systems and programs focused on needs of students such as the career development system through 『Dream-Design』 Consultation. Under the undergraduate system composed of 2 divisions (4 majors) and 2 departments, students learn to become leaders with practical skills through special programs of the major/department unit and joint programs at the university level.</p><p>The best way to predict future is building one's own future. College of Business Administration will be the leader of making a global prestigious university that can lead changes and explore the future with the faculty, students, alumni and everyone else who are giving us supports and interests.</p>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts351_intro_bg.jpg"
                    },
                    {
                        "course_name": "Art, Culture and Engineering",
                        "course_description": "<p>ACE College is the new name of Kangwon National University's \"College of Art, Culture and Engineering\", which has been innovatively integrated since March 2019. The College of Engineering and the College of Culture and Arts opened in 1974 and 1977, with the purpose of cultivating excellent human resources who will play a pioneering role in the development of engineering and culture and arts. In 2019, through 「Innovative College Integration」, we created ACE College, a playground of convergence leaders that embraces culture and arts and engineering, and provide creative convenience to the future society and human life.</p><p>ACE College pursues the college’s educational goal, 「A talented person with creativity to lead innovation in the global era, crossing the boundaries of art and engineering」 and working hard to nurture convergence manpower with following competencies with 120 professors from 17 departments/majors.</p><ul><li>Professionalism and creative thinking skills necessary to realize future-oriented values ​​in the fields of culture, arts and engineering</li><li>Enterprising spirit to simultaneously pursue sustainable prosperity of the region and the world</li><li>Moral character that enhances the value of life, presents a vision for life, and pursues the common good of mankind and society</li><li>Convergent thinking ability to realize new art or engineering content that combines cultural and artistic sensibility and engineering knowledge</li><p>ACE College boldly breaks away from the old framework and boundaries of existing education and opens and operates a variety of multidisciplinary liberal arts/major courses based on 「1 art for 1 person」 and 「1 technique for 1 person」. We are preparing for the era of the 4th industrial revolution through innovative programs that respond to future convergence technologies, such as the establishment of a new AI application research group</p></ul>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts361_intro_bg.jpg"
                    },
                    {
                        "course_name": "Agriculture and Life Sciences",
                        "course_description": "<p>College of Agriculture and Life Sciences aims to cultivate high-quality manpower who can research, develop, and apply key technologies that are required to develop the food industry, which is the basic strategic element for survival of people and national development, into high-tech industry.</p><p>College of Agriculture and Life Sciences offers various majors including Applied Plant Sciences, Biological Environment, Regional Infrastructure Engineering, Applied Biology, Horticultural Science, Biosystems Engineering, Agricultural and Resource Economics, Food Science & Biotechnology, and Environmental Science. And it operates various programs related to \"dream-like bioengineering; environment, which provides the root of human life and health; development of the food production industry, which is the basic strategic element for survival of people and national development; securement of diversity in microorganisms and bioresources; base engineering and industrial engineering for biological production; and improvement of the quality of human life through the utilization of gene resources and plant resources\".</p><p>Graduates can work as civil servants of national research institutions related to agriculture (Rural Development Administration, Agricultural Research and Extension Services, Agricultural Technology Center, Institute of Health & Environment, National Agricultural Products Quality Management Service, and more) or work at research institutes and businesses related to the major, fertilizer and pesticides companies, construction companies, design and inspection companies, major agricultural machinery companies, financial institutions, public enterprises, distribution companies, and biosciences laboratories. Students can also continue their studies by going to graduate schools or studying abroad.</p>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts361_intro_bg.jpg"
                    },
                    {
                        "course_name": "Animal Life Sciences",
                        "course_description": "<p>The animal industry was developed to enrich the survival and life quality of humans. As the culture of the economic sector expands, and demands of people are diversified, the domain of the animal industry is expanding to a comprehensive study that covers fields of production of economic animals, development and processing of animal feeds, processing and distribution of produced goods, hygiene, and environment.</p><p>College of Animal Life Sciences is the only specialized school among the national universities across the nation for comprehensively studying and educating animal industries by field in college unit. The department boasts renowned professors in each academic area, and is equipped with basic and advanced experiment and practice equipment in general laboratory as well as laboratories in each major sector. Thus, the department carries out field-focused education through experiments and practices at animal farms and general study of theories and principles related to animal resources.</p><p>Furthermore, it is leading the activities of education, research, volunteer, etc. by organically linking researches of professors from each field and performing advanced and cooperative researches through the Institute of Animal Resources.</p>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts409_intro_bg.jpg"
                    },
                    {
                        "course_name": "Education",
                        "course_description": "<p>The College of Education successfully increased the ratio of students from the metropolitan areas up to 40%, and the number of students of the upper rank classes is steadily increasing. It offers outstanding educational experiences and professors with knowledge and experience.</p><p>It offers educational facilities include division (department) seminar rooms, curriculum education office, experiment and practice rooms, geographic system lecture room, calligraphy room, educational media studio, GIS and quantitative geography laboratory, analytical laboratory for class behavior (installed One Way Mirror), multimedia learning material development room, educational information laboratory, multimedia foreign language study room, and an astronomical observatory. It also operates foreign language (English) lectures, native speaker education, and various foreign culture experiences in preparation for internationalization.</p><p>In addition, it offers systematic career education through the adviser system by major and year, and actively helps students in their job searches by connecting them to a network of department professors.</p>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts430_intro_bg.jpg"
                    },
                    {
                        "course_name": "Social Sciences",
                        "course_description": "<p>All social sciences are studies to cultivate critical intelligence, integrated sensitivity, and practical intelligence for clearer and brighter future through scientific investigation on social phenomena.</p><p>College of Social Sciences is composed of 7 departments including Department of Public Administration, Department of Real Estate, Department of Political Science, Department of Journalism & Mass Communication, Department of Psychology, Department of Sociology, and Department of Cultural Anthropology. They all operate the best faculty and high-tech facilities for students to build extensive general knowledge and specialized knowledge.</p><p>College of Social Sciences is composed of 7 departments including Department of Public Administration, Department of Real Estate, Department of Political Science, Department of Journalism & Mass Communication, Department of Psychology, Department of Sociology, and Department of Cultural Anthropology. They all operate the best faculty and high-tech facilities for students to build extensive general knowledge and specialized knowledge.</p><p>College of Social Sciences welcomes all students who have a great interest in the humankind, society, ethnicity, and world.</p><p>Students who enjoy extensive reading, deep thinking, and open discussions will be able to participate in various practical activities for clearer and brighter future by goring through 4 years of 'polishing' in the 'Square of Intelligence’ provided by our university.</p>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts455_intro_bg.jpg"
                    },
                    {
                        "course_name": "Forest and Environmental Sciences",
                        "course_description": "<p>The College of Forest and Environmental Sciences operates the Forest Science Research Institute, Changgang Institute of Paper Science & Technology, Experiment Forest, and EPLC (Eco Piece Leadership Center) as the cooperative and affiliate institutions for advanced research and education. The College of Forest and Environmental Sciences reinforced the academic and industrial cooperative system with these institutions to continuously provide high-quality manpower to governmental organizations, research institutes, and businesses related to forest and environment. The academic cooperation course for graduate students helps them form organic relationships.</p><p>The College of Forest and Environmental Sciences operates certificate preparation courses for students so they can obtain additional points in preparation for employment for various positions, such as forest engineer, forest product processing engineer, forest seeding engineer, plant protection engineer, landscape architecture engineer, engineer in natural environment and ecological restoration, urban planning engineer, survey geo-spatial information engineer, cultural properties repair engineer, and tree protection engineer. Furthermore, with the increasing demands for employment as civil officials of the forest and environment field, including forest resources and landscaping, the College of Forest and Environmental Sciences provides unlimited support and education in helping students prepare for employment by selecting candidates and operating a special course for preparation of civil service.</p><p>Meanwhile, the College of Forest and Environmental Sciences operates various sister university and student exchange programs to enhance international education and practices, recognizing education completed in overseas schools as acquired credits. During the semester, famous professors and students from overseas universities are invited to provide intensive lectures for international exchanges.</p><p>The College of Forest and Environmental Sciences operates reeducation programs for employed and unemployed graduates during vacation and has enhanced education in the field of computing to raise the employment rate and practical ability of graduates.</p>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts470_intro_bg.jpg"
                    },
                    {
                        "course_name": "Veterinary Medicine",
                        "course_description": "<div><h1>Educational Goals / Characteristics</h1><p>The College of Veterinary Medicine aims to cultivate experts in veterinary medicine equipped with outstanding abilities. It trains theories and practices in the veterinary field related to animal health and diseases to prevent and treat animal diseases. Additionally, it fosters research ability in pharmaceuticals, public health, and life science to contribute to the nation and human society.</p><h2>Major Details and Fields</h2><p>The college offers various majors including Veterinary Anatomy, Biochemistry, Physiology, Pathology, Pharmacology, Surgery, and more, covering a wide range of subjects related to veterinary medicine.</p><h2>Career after Graduation / Outlook</h2><p>Graduates can pursue careers in treating diseases and increasing productivity of commercial animals and pets, preserving wild and aquatic animals, conducting animal studies and disease model research, ensuring safety of various foods, preventing zoonotic diseases, and conducting bioengineering research.</p><h2>Affiliated Organizations</h2><ul><li><strong>Animal Hospital:</strong> Affiliated with the university, providing veterinary clinical training and services to the local community.</li><li><strong>Wild Animal Rescue Center:</strong> Aims to contribute to coexistence of people and animals by rescuing and treating injured wild animals and protecting natural ecosystems.</li><li><strong>General Animal Medical Research Institute:</strong> Promotes academic development of veterinary medicine related to animal diseases and food hygiene through research, academic exchanges, and symposiums.</li></ul></div>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts482_intro_bg.jpg"
                    },
                    {
                        "course_name": "Pharmacy",
                        "course_description": "<p>The College of Pharmacy contributes to producing professional pharmacists demanded by the current era through advanced and systematic curricula. Since transitioning to a 6-year-course in 2009, it has played an increased role in society.</p><p>The college plays a vital role in national policy consultation and pharmacy with dedicated professors and state-of-the-art equipment for education and research. It has established an herb garden for outdoor training, enhancing the efficiency of practical lessons.</p><p>Pharmacists perform various functions in pharmacies, hospitals, pharmaceutical companies, and regulatory bodies like the Ministry of Food and Drug Safety. They contribute to medicine development and national health.</p><p>Students need active and progressive attitudes to develop and solidify the functions of pharmacists.</p><p>The College of Pharmacy requests continued support with passion and interest to become a center of education and research with global competitiveness in the 21st century.</p>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts488_intro_bg.jpg"
                    },
                    {
                        "course_name": "Nursing",
                        "course_description": "<p>The Master’s course of the graduate school opened its door in 1998, and the college established its doctorate course, the only one of its kind in Gangwon-do, in 2008, producing outstanding talents. In 2008, the Health Care Research Institute affiliated under KNU was established to demonstrate research and academic competence.</p><p>Most graduates from the College of Nursing are working in various fields and outstanding medical institutes around the county. The College of Nursing is striving to become a place of education to demonstrate its education and research competence as a flagship university and cultivate the professional nursing manpower that society requires.</p>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts491_intro_bg.jpg"
                    },
                    {
                        "course_name": "Biomedical Science",
                        "course_description": "<div><h2>Educational Goals / Characteristics</h2><p>College of Biomedical Science aims to cultivate talents with basic education, creative research ability, and the spirit of communication and volunteer based on bioscience/engineering to enhance the quality of human lives. In other words, the mission of our college is to train creative pioneers of biomedical science and biomedical industry of the 21st century as well as global talents with creativity and integrated leadership. College of Biomedical Science offers various programs such as LINC+ Project Group and Medical BIT Education Support Center (supported by the Ministry of Education) to help student's education, employment activities, and competence development.</p><h2>Major Details and Fields</h2><p>College of Biomedical Science is composed of Division of Biomedical Convergence (Department of Systems Immunology and Department of Medical Biotechnology), Department of Molecular Bioscience, Department of Bio-Health Technology, and Department of Medical Biomaterials Engineering. The Graduate School offers Department of Biomedical Science (Master’s and PhD courses) and Department of Bio-Health Technology (Master’s course). College of Biomedical Science operates Biomedical Science Research Institute and Antibody Research Institute for research support, and is connected with Scripps Korea Antibody Institute and Stem Cell Research Institute.</p><h2>Career after Graduation / Outlook</h2><p>Graduates advance to various fields including bioscience research institutes, national universities, public health and medical centers, genetic industry, companies of food, cosmetics, and overall bioindustry, pharmaceutical companies, and medicine. Students can also advance to graduate schools or medical/law schools to have professional career.</p><p>Employers include: Hankook Korus Pharm, LG Household & Health Care, Korea Yakult, Green Cross, Ottogi, Amorepacific, CJ Research Institute of Biotechnology, HUGEL, Boditech Med, Gyeonggi Natural Products Research, RADIANT, Catholic University of Korea College of Medicine, Severance Hospital, Handok, Korea Institute of Oriental Medicine, JW Pharmaceutical, Daewoong Pharmaceutical, Han Wha Pharma, Boryung Pharmaceutical, Kolon Life Science, Celltrion, IL-YANG Pharmaceutical, Yuhan Corporation, Chong Kun Dang Pharmaceutical, Erom, PharmAbcine, Chuncheon Bioindustry Foundation, Samsung BioLogics, banks, Korean National Police Agency, national and public governmental officials, Institute of Health & Environment, Ministry of Food and Drug Safety (MFDS), Scripps Korea Antibody Institute (SKAI), overseas companies and more.</p></div>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts494_intro_bg.jpg"
                    },
                    {
                        "course_name": "Humanities",
                        "course_description": "<p>Through a long-distance study room that operates video lectures as well as 1:1 voice and video chatting with various overseas countries including Waseda University of Japan, students learn to adapt to the era of internationalization.</p><p>The College of Humanities also offers digital multimedia courses in multiple special lecture rooms. Various contents required for these courses are directly produced and developed in the media editing studio.</p><p>The College of Humanities plans to reinforce computer education and practices to lead informatization. Additionally, it will strengthen foreign language education and develop practical foreign language education programs to cope with the global era.</p><p>For the media generation that is familiar with digital and video culture, the College of Humanities jointly develops courses related to visual and performance art, and reinforces joint researches of courses that cover culture and art in overseas and domestic regions.</p><p>Through these efforts, the College of Humanities will lead cyber education and distance education by developing new educational contents and incorporating the latest IT technologies and multimedia educational media into the humanities. The College of Humanities will grow as a university that can contribute to the education and research of Northeast Asian humanities and the development of Northeast Asian culture by taking the initiative in ensuring that Korea plays a leading role in the politics, economy, and culture of the Northeast Asia.</p>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts503_intro_bg.jpg"
                    },
                    {
                        "course_name": "Natural Sciences",
                        "course_description": "<div><h2>Educational Goals / Characteristics</h2><p>The College of Natural Sciences is training professional manpower of basic science with theories and knowledge of natural science, and practical high-quality manpower with professional knowledge and competence based on various practices.</p><h2>Career after Graduation / Outlook</h2><p>Career paths after graduating from the College of Natural Sciences are largely divided into finding a job or entering a graduate school. Most graduates are working in businesses, research circles, or academic circles. Various paths are classified according to a graduate’s domain of study, and detailed information can be found on the website of each department.</p><h2>Affiliated Institutes</h2><ul><li>Research Institute for Basic Science</li><li>Institute of Life Sciences</li><li>Research Institute for Earth Resources</li><li>Cave Research Institute of Korea</li><li>Institute of Environmental Research</li></ul><h2>Cooperation Organizations</h2><ul><li>Central Laboratory</li><li>Korea Basic Science Institute Chuncheon Center</li></ul></div>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts520_intro_bg.jpg"
                    },
                    {
                        "course_name": "Information Technology （KNUIT）",
                        "course_description": "<p>KNUIT is a large college that includes various domains of studies such as the Department of Electrical Engineering that opened in 1982, the Department of Electronics, the Department of Controls & Instrumentation Engineering, the Department of Computer Engineering, the Department of Computer and Communications Engineering, and the Department of Data Processing. It obtained an independent structure in 2006 to foster more specialized manpower, and it currently teaches and studies electrical engineering, electronic engineering, computers, IT convergent technology, and information media. The goal is to “cultivate progressive technicians with future adaptability” and “cultivate creative technicians with practical ability.” KNUIT is categorized into the Department of Electric & Electronics Engineering, the Department of Electronics Engineering, the Department of Computer Science & Engineering, and recruits and educates specialized students.</p><p>Graduates of KNUIT have advanced to society through domestic and overseas companies, research and public institutions, entrepreneurship, and so on, and are well-received in their respective communities. KNUIT will continue to foster talented people who will be leaders in the 21st century IT industry through the education and research of faculty members who are professionally trained in theory and practice.</p>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts536_intro_bg.jpg"
                    }
                ]
            },
            {
                "collage_name": "Samcheok Campus",
                "courses": [
                    {
                        "name": "College of Engineering",
                        "description": "<div id=\"college-of-engineering\">\n  <h2>Vision</h2>\n  <p>The College of Engineering aims to raise engineers who can lead the affluent future of our society. The university that puts the students’ dreams first, and strives to help students achieve their dream. KNU's College of Engineering is the right place for you.</p>\n\n  <h2>Educational Objectives</h2>\n  <ul>\n    <li>Training creative engineers with practical expertise</li>\n    <li>Training engineers with virtue and intelligence</li>\n    <li>Training future-oriented engineers with international competitiveness</li>\n  </ul>\n</div>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts1103_intro_bg.jpg"
                    },
                    {
                        "name": "College of Humanities, Social Sciences and Design, Sports",
                        "description": "<p>Under the philosophy of raising outstanding talents needed by modern society, the College of Design & Sports carries out various forms of practical education to contribute to the quantitative and qualitative improvement of the future environment through systematic curricula, advanced learning environments, excellent faculty, and practical and structured composition of departments.</p>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts1101_intro_bg.jpg"
                    },
                    {
                        "name": "College of Health Science (Dogye)",
                        "description": "<div id=\"college-of-health-science\">\n  <h2>Vision</h2>\n  <ul>\n    <li>Converting to a customized, practical manpower development system that focuses on consumers</li>\n    <li>Bringing about quantitative and qualitative improvements to the employment rate through expansion of chances for advancement in the fields of life, health, and welfare</li>\n    <li>Reinforcing advanced research abilities capable of leading KNU</li>\n    <li>Establishing academic-industrial cooperation and maximizing international cooperative organizations in the fields of life, health, and welfare</li>\n    <li>Empowering the training of global and multidisciplinary manpower</li>\n  </ul>\n\n  <h2>Objectives and Action Plan</h2>\n  <ul>\n    <li>Reinforcement and differentiation of major education that focuses on practical affairs</li>\n    <li>Reinforcing progressive instructional research</li>\n    <li>Increasing employment competency and employment rate of students</li>\n    <li>Establishing an academic-industrial network and a base for international cooperation</li>\n    <li>Training global and multidisciplinary leaders</li>\n  </ul>\n\n  <p>The College of Health Science is a specialized college that strives to build a healthy society and a bright future through creative education. It cultivates experts of each field who can play a pivotal role in promotion of national health and improvement of human welfare.</p>\n</div>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts1112_intro_bg.jpg"
                    },
                    {
                        "course_name": "Division of Liberal Studies",
                        "course_description": "<p>The General Studies track allows students, after their first year, to choose and pursue the department or major that aligns with their interests and career goals. The Student-Designed Majors track is tailored for the cultivation of creative, self-directed, and integrative talents. Students who opt for this track design and pursue their own majors based on their personal interests, aptitudes, and envisioned career trajectories. In essence, they lead the creation of majors specialized in cultivating creative and convergent talents such as 'Data-Driven Regional Innovation and Glocal Leadership', 'Digital Innovation and Technology', 'Science and Technology Convergence Communication and Entrepreneurship', and 'Creator Management'. This student-led approach enables them to develop the skills necessary to respond to the changes of the future society while continuing their education within the Division of Liberal Studies.</p>",
                        "image": "https://kangwon.ac.kr/site/www/images/contents/cts1904_intro_bg.jpg"
                    }
                ]
            } 
        ]
    }
]