[
    {
      "college_name": "College of ICT Convergence",
      "courses": [
        {
          "course_name": "School of AI",
          "course_description": "<div id=\"ai-department\">\n  <h2>Introduction to the Department</h2>\n  <p>The Core of Fourth Industrial Revolution - Artificial Intelligence (AI), Information and Communication Software. The AI department leads the AI major in artificial intelligence, which is centered on artificial intelligence, and information and communication software major in the next generation of communication including 5G. The core of the fourth industrial revolution is artificial intelligence and information and communication technology. Information and communication software is a technology that delivers and generates various data and information using information and communication technologies such as the Internet of Things and networks. Artificial intelligence is a machine with human intelligence that effectively manages, analyzes, and judges data. By completing a variety of artificial intelligence-related subjects, you will graduate with a major in information and communication software. The AI department aims to foster key talents in the field of specialized artificial intelligence that will lead the fourth Industrial Revolution Also, it is selected as SW-centered university and offers various benefits such as scholarships and US IT training.</p>\n\n  <h2>Career after graduation</h2>\n  <p>[Employment] All companies that need artificial intelligence convergence, software-related companies, information and communications-related companies AI-related graduate schools such as KAI ST, Korea University, GIST, and Sungkyunkwan University</p>\n</div>\n",
          "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_01_01_img1.png"
        },
        {
          "course_name": "Computer Science",
          "course_description": "<div id=\"computer-engineering-department\">\n        <h2>Introduction to the Department</h2>\n        <p>The department of computer engineering, a key department of IT study at Tongmyong University, operates practical major education courses linking theory and advanced technology to meet the needs of businesses in the IT field. Gain knowledge of various IT domains, including open-source software, games and graphics, the Internet of Things, smartphone apps, ubiquitous computing, artificial intelligence, computer hardware, software engineering, and developing major skills to acquire practical talent required by the Fourth Industrial Age.</p>\n      \n        <h2>Career after graduation</h2>\n        <p>Samsung Electronics, Microsoft Korea, Kakao, Nexon, NCSoft, Netmarble, Intel Korea, Accenture, Hangul and local IT companies, government/local organizations, state-funded research institutes, graduate schools, etc.</p>\n      </div>\n      ",
          "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_01_02_img1.png"
        },
        {
          "course_name": "Department of Game Engineering",
          "course_description": "<div id=\"game-engineering-department\">\n        <h2>Introduction to the Department</h2>\n        <p>The Department of Game Engineering at Tongmyong University was established as a department to train professionals in the game field through a four-year program for the first time in Busan. We have consistently produced professional game programming professionals and supplied competent game personnel to the entire region and country. Game engineering departments are now working to train excellent game programming professionals and software developers in various content fields to meet the era of the Fourth Industrial Revolution, where all sectors are revolutionized through S/W. Game programming experts refer to those who have the ability to develop game algorithms such as ability to design, code, and implement principles in game programming. The goal of the game engineering department is to foster professional skills that can be active in both the game and IT sectors.</p>\n      \n        <h2>Career after graduation</h2>\n        <p>Game developer, IT companies, digital content production companies, mobile/internet app development companies, corporate research institutes, graduate schools, etc.</p>\n      </div>\n      ",
          "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_01_03_img1.png"
        },
        {
          "course_name": "Department of Refrigeration and Air-Conditioning Engineering",
          "course_description": "<div id=\"refrigeration-air-conditioning-engineering-department\">\n        <h2>Introduction to the Department</h2>\n        <p>The Department of Refrigeration & Air-Conditioning Engineering applies to fields of life engineering, transportation machinery, storage processing, refrigeration, air conditioning, renewable energy, building machinery, aerospace, precision machinery and advanced medical equipment. The aim of this department is to foster skilled engineers who are able to improve the productivity of machinery and manufacturing to design spatial environment.</p>\n      \n        <h2>Career after graduation</h2>\n        <p>Korea Gas Corporation, Korea Gas Safety Corporation, Korea Heating Corporation, District Gas Companies & Corporation, Distribution Technology Corporations, etc.</p>\n      </div>\n      ",
          "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_02_03_img1.png"
        },
        {
          "course_name": "Department of Port Logistics System",
          "course_description": "<div id=\"port-logistics-system-department\">\n        <h2>Introduction to the Department</h2>\n        <p>The Department of Port Logistics System aims to foster human resources who can operate and manage port logistics and non-automated systems. Systematically, the course consists of logistics management skills based on transportation, storage, unloading, and information. Students learn engineering insights and problem-solving abilities throughout practical classes.</p>\n      \n        <h2>Career after graduation</h2>\n        <p>Port Logistics Corporations (Shipping, Public, and Composited logistics), Container terminals, Distributors, and Inland Transportation Companies, Forwarding Companies, Logistics information Companies, Port logistics research institutes, Entry to Graduate School</p>\n      </div>\n      ",
          "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_02_05_img1.png"
        },
        {
          "course_name": "Software Convergence Security",
          "course_description": "<div id=\"information-security-department\">\n        <h2>Introduction to the Department</h2>\n        <p>Founded in 2005 as the first in Busan, Ulsan, and South Gyeongsang Province, our department has continued to produce next-generation security leaders (BoB) and has already established itself as a prestigious information security education by achieving employment rates at the top of the country by 2020. In addition to attracting various state-funded projects, including CK projects and software-oriented university projects, we have established on-site education programs including \"Hacking Response Training Center\" to concentrate all our capabilities on fostering working-level personnel. The information security sector is already recognized by many domestic and foreign media as a promising future job and is recognized as a key area of the software-based Fourth Industrial Revolution. Therefore, our department is preparing for another huge leap forward with you by converging AI-related technologies based on the long history and tradition of fostering professionals who will lead the future society. We'd like you to join us for this bright future.</p>\n      \n        <h2>Career after graduation</h2>\n        <p>AhnLab, SK Infosec, CyberOne, Samsung Electronics, BNK Busan Bank, Igloo Security, CubePia, Haiti, and Security, the National Health Insurance Corporation, the Korea Culture and Content Agency, Costco, Busan Metropolitan Police Agency, Seunwon, Busan Metropolitan Government.</p>\n      </div>\n      ",
          "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_01_04_img1.png"
        },
        {
          "course_name": "Data Science",
          "course_description": "<div id=\"data-science-department\">\n        <h2>Introduction to the Department</h2>\n        <p>The era of the Fourth Industrial Revolution is increasing in importance to the extent that it is the age of data technology. The Department of Data Science is a new department to be established in 2021 and aims to train \"data science experts to lead the Fourth Industrial Revolution.\" This department trains professional technical staff of data science with creative and highly analytical data science skills, globally competitive workers, and people who will drive technology advancement. It also fosters the ability to collect, analyze and leverage data to meet the growing demand for data professionals and preempt new global market opportunities due to explosive data volumes worldwide. In this department, talented people who can data will be produced in various fields of society and industry to act as data technology experts who can demonstrate their ability in data analysis. We hope you will challenge yourself to become a \"data expert\" who will lead the future industry.</p>\n      \n        <h2>Career after graduation</h2>\n        <p>Government, local governments, public institutions, offices of education, universities, elementary, middle and high schools, Google, Microsoft, Amazon, Apple, Samsung Electronics, Samsung SDS, LG Electronics, LGCNS, Hyundai, financial institutions, fintech companies, logistics companies, Distributor</p>\n      </div>\n      ",
          "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_01_05_img1.png"
        }
      ]
    },
    {
      "college_name": "College of Business Administration",
      "courses": [
        {
          "course_name": "Department of Business Administration",
          "course_description": "<div id=\"business-administration-department\">\n            <h2>Introduction to the Department</h2>\n            <p>The Department of Business Administration cultivates competent global talents who can strategically operate various management organizations centered on companies. By reading the changes in the future environment symbolized by the Fourth Industrial Revolution, we educate through theory and practice in a balanced manner to assure the continuation of the organization and foster future managers who can grow and develop the organization. Furthermore, we provide specialized guidance and support activities to students who want to develop their startup experience based on fostering entrepreneurship.</p>\n          \n            <h2>Career after graduation</h2>\n            <p>Wherever there is a company, it needs a person who majored in business administration. In particular, after graduating from the Department of Management, you can find employment in general enterprises such as IT, venture and small businesses, manufacturing, service, accounting firms, banks, securities companies, other financial companies, and public institutions such as government investment institutions, and education institutions.</p>\n          </div>\n          ",
          "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_03_02_img1.png"
        },
        {
          "course_name": "Department of International Trade and Logistics",
          "course_description": "<div id=\"international-logistics-department\">\n            <h2>Introduction to the Department</h2>\n            <p>Fostering global logistics experts who will lead the era of the 4th Industrial Revolution. The Department of International Logistics is a high-tech department of the future to foster global logistics professionals who will lead the era of the 4th Industrial Revolution. The 4th Industrial Revolution is led by innovation in digital advanced technologies such as artificial intelligence (AI), smart factories, and the Internet of Things (IoT), as well as international logistics that manages, operates, and optimizes industries and businesses using these technologies. The Department of International Logistics aims to cultivate professional manpower required in the shipping, port, aviation, logistics and marine industries, finance, MICE, trade, information and communication, and marine cruise industries, as well as global companies that are the innovators of the 4th Industrial Revolution. We operate and provide international and systematic education, research, industry-academia cooperation, international exchange and scholarship support programs. Through this, the department has recorded a high employment rate and academic achievement (10 winning teams at the National University Thesis Contest over the past 5 years), and has a strong global network (student exchange with over 30 universities abroad and dual degree programs) and industry-academic cooperation networks (100 logistics companies and family business networks in Busan/Gyeongnam).</p>\n          \n            <h2>Career after graduation</h2>\n            <p>Shipping, ports, aviation, logistics and marine industries, as well as domestic and foreign multinational corporations, distribution, finance, insurance, MICE, trade and information and communication fields, government, state-owned enterprises, public enterprises, research institutes, domestic and foreign graduate schools, etc.</p>\n          </div>\n          ",
          "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_03_09_img1.png"
        },
        {
          "course_name": "Department of Hotel Culinary & Bakery",
          "course_description": "<div id=\"hotel-management-department\">\n            <h2>Introduction to the Department</h2>\n            <p>We offer a curriculum that is strong in hotel practice and can be directly applied at the hotel site in order to cultivate talented individuals who can meet the evolving needs of the hotel industry and seamlessly integrate into the global hotel market. Our curriculum is organized to provide immediate employment-focused education and career guidance.</p>\n          \n            <h2>Career after graduation</h2>\n            <p>Possible employment opportunities cover the entire hospitality and tourism industry, including hotels. However, to maximize educational effectiveness through choice and concentration, the curriculum is organized based on hotel department organization, such as guest rooms, food and beverage, and business areas like management support, casino, events, etc. Since there are various job opportunities that require foreign language skills compared to other majors, we strengthen students' foreign language proficiency by offering English-only lectures. Graduates from our department can pursue careers in front & back offices, restaurant business, exhibition conventions, casino business (domestic and international), airline (domestic and international), and cruise crew at domestic and international hotels.</p>\n          </div>\n          ",
          "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_03_06_img1.png"
        },
        {
          "course_name": "Department of Global Tourism",
          "course_description": "<div id=\"tourism-convention-department\">\n            <h2>Introduction to the Department</h2>\n            <p>The department's goal is to foster practical tourism & convention professionals and focus on training, and open education for competitive tourism professionals. Based on foreign language skills, we train individuals who can carry out various tasks by combining international tourism and convention expertise. Accordingly, we offer certification classes such as overseas travel guide, domestic travel guide, coffee barista, sommelier, convention agency, air reservation ticketing, and shipowner technician.</p>\n          \n            <h2>Career after graduation</h2>\n            <p>Graduates from our department can pursue careers in travel agencies, airlines, hotels, restaurants, convention centers, cruise lines, multi-resorts, tourism-related service jobs, graduate school, resorts, condominiums, casinos, wedding event companies, catering, theme parks, middle and high school teaching positions, tourism associations, tourism agencies, and consulting institutes.</p>\n          </div>\n          ",
          "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_03_05_img1.png"
        }
      ]
    },
    {
      "college_name": "College of Welfare and Education",
      "courses": [
        {
          "course_name": "Department of Nursing",
          "course_description": "<div id=\"nursing-department\">\n        <h2>Introduction to the Department</h2>\n        <p>The Department of Nursing, based on the founding philosophy of Tongmyong University, serves to promote the health of humanity around the world, and trains nurses with professional practical skills and problem-solving skills through critical thinking. Since its establishment in 2010, it has been certified for 5 years (2019-2024) in the 3-cycle evaluation of the Korea Nursing Education and Assessment Service, and has operated a systematic outcome-based curriculum to nurture nursing talents with field-oriented practical skills. Based on the vision of Tongmyong University that places importance on industry-academic practical education, the Department of Nursing at Tongmyong University is proud of its outstanding practical education such as simulation and in-school practice using advanced equipment, and clinical practice education at excellent practice agreement organizations.</p>\n      \n        <h2>Career after graduation</h2>\n        <p>Graduates from our department can pursue careers as domestic and foreign licensed clinical nurses (RN, Registered Nurse), nursing and health officials, professional nurses (APN, Advanced Practice Nurse), industrial managers, international nurses, midwives (CNM Certified Nurse-Midwife), medical coordinators, nursing educators, etc.</p>\n      </div>\n      ",
          "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_04_01_img1.png"
        },
        {
          "course_name": "Department of Speech Language Pathology and Aural Rehabilitation",
          "course_description": "<div id=\"speech-pathology-department\">\n        <h2>Introduction to the Department</h2>\n        <p>The Department of Speech-Language Pathology and Audiology is a speech rehabilitation program that systematically evaluates and mediates various communication problems of children and adults with speech-language impairment, and trains audiologists in charge of hearing rehabilitation and hearing management of children and adults with communication difficulties due to hearing loss. In other words, it is a department that fosters two differentiated experts in the areas of language development disorder, articulation disorder, speech disorder, fluency disorder, neuro-speech language disorder, etc. After completing a curriculum that combines theory and practice in the areas of speech and language disorders, and passing the certification exam after graduation, students will acquire the national certificate of language rehabilitation level 2. Additionally, passing the audiologist qualification exam after theoretical and practical training in the areas of hearing impairment, such as hearing aid evaluation and suitability, behavioral hearing evaluation, and hearing rehabilitation, will also grant the audiologist certificate. We foster on-site speech rehabilitation and audiologists through clinical and field practice at Tongmyong Language Clinical Center and Hearing Lab, which are on-campus practice rooms, as well as at leading university hospitals and private speech therapy centers in the Busan area.</p>\n      \n        <h2>Career after graduation</h2>\n        <ul>\n          <li><strong>Language Rehabilitation Doctor:</strong> Rehabilitation Medicine Department of General Hospital-Neurology-Pediatric Psychiatry-Otorhinolaryngology department speech therapy room, private hospital speech therapy room, individual speech therapy room, welfare center speech therapy room, special school speech therapy room, etc.</li>\n          <li><strong>Audiologist:</strong> Hearing examination room belonging to the otolaryngology department of general hospitals, hearing examination room in private hospitals, hearing aid centers, hearing rehabilitation centers, hearing-related industry (hearing aid and cochlear implant companies, sound companies, etc.)</li>\n        </ul>\n      </div>\n      ",
          "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_04_02_img1.png"
        },
        {
          "course_name": "Department of Sperts Rehabilitation",
          "course_description": "<div id=\"sports-rehabilitation-department\">\n        <h2>Introduction to the Department</h2>\n        <p>Our department has made significant progress in a short period of time, starting as the Department of Physical Education in 2004. In particular, the program is part of a national education support project called \"Sports Industry Professional Training Project,\" aimed at providing students with a competitive advantage in entering society. We have made concerted efforts to achieve this goal. Based on this, in order to meet the trend of the new era, we specialize in the field of sports rehabilitation to cultivate excellent human resources. Our educational goals include training \"athlete rehabilitation training experts\" responsible for sports injury prevention, rehabilitation, and performance improvement, nurturing \"elderly exercise rehabilitation experts\" in the sports healthcare field in preparation for increased life expectancy, and fostering \"health exercise management experts\" to promote wellbeing in terms of health and physical fitness.</p>\n      \n        <h2>Career after graduation</h2>\n        <p>Graduates from our department can pursue careers in public institutions' health promotion centers, hospital sports and exercise prescription centers, public institutions' national fitness centers, various business and social welfare organizations related to sports rehabilitation and exercise prescription, specialized sports rehabilitation centers, professional sports teams and related companies, fitness and health care facilities, and the fields of education and research.</p>\n      </div>\n      ",
          "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_04_03_img1.png"
        }
      ]
    },
    {
            "college_name": "College of Beauty Art",
            "courses": [
                {
                    "course_name": "Department of Beauty Care",
                    "course_description": "<div id=\"beauty-medical-science-department\">\n<h2>Introduction to the Department</h2>\n<p>Based on the professional perspective and academic understanding of beauty, we introduce alternative medical methods that apply scientific and practical academic characteristics to create a global beauty leader who can advise on healthy life.</p>\n\n<h2>Career after graduation</h2>\n<p>After graduating from our department, students can pursue careers as middle and high school teachers, professors, educational instructors, colorists, hair designers, spa therapists, scalp management specialists, broadcast coordinators, beauty salon professionals, cosmetics company employees, makeup artists, and managers of domestic and international cosmetics brands.</p>\n</div>\n",
                    "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_04_05_img1.png"
                },
                {
                    "course_name": "Department of Fashion Design",
                    "course_description": "<div id=\"fashion-design-department\">\n<h2>Introduction to the Department</h2>\n<p>The Department of Fashion Design focuses on the study of design and related studies concerning clothing that reflects individual image or personality. Its goal is to cultivate fashion professionals with a forward-looking approach, possessing creative artistic skills and practical expertise. The department offers a professional curriculum emphasizing hands-on practice, covering not only clothing construction but also fashion design expression and various related subjects. Additionally, students are provided with opportunities to enhance their practical experience and artistic sensibilities through participation in presentations, competitions, and fashion shows, aiming to produce well-rounded professionals poised to contribute to the fashion industry.</p>\n\n<h2>Career after graduation</h2>\n<p>After graduating from our department, students can pursue careers in various fields such as fashion design, styling, merchandising (MD), bag design, performance costume design, underwear design, personal brand launching, accessory design, fashion journalism, clothing manufacturing, dress academy instruction, performance agencies, broadcasting stations, movie companies, magazine companies, multimedia companies, event companies, and design offices.</p>\n</div>\n",
                    "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_05_06_img1.png"
                }
            ]
    },
    {
            "college_name": "College of Architecture and Design",
            "courses": [
                {
                    "course_name": "Department of Architecture",
                    "course_description": "<div id=\"architecture-department\">\n<h2>Introduction to the Department</h2>\n<p>The Department of Architecture has successfully completed the BIM (Building Information Modeling) specialization program over the past five years with the support of the Ministry of Education's specialization project, which has been incorporated into the curriculum. This program has been recognized as a major feature and achievement of the training program. The architectural design classes in our department are conducted in small groups of 15 students, allowing for personalized 1:1 instruction. Our facilities include a design studio open 24/7, equipped with tools such as laser cutters and 3D printers, as well as a BIM practice facility utilizing a supercomputer. Additionally, we offer various opportunities such as joint workshops in collaboration with Paris-Belleville University in France. We offer both four-year and five-year courses, providing flexibility in career options. In the Korea Architecture Competition, our students have achieved notable success, ranking 2nd in 2016, 1st in 2017, and winning 3 out of 7 main awards. Every year, our department consistently receives the most awards in this competition. As a result, our graduates are highly sought after by the nation's top architectural firms.</p>\n\n<h2>Career after graduation</h2>\n<p>After graduation, students from the Department of Architecture have career opportunities in architectural firms, BIM-related firms, construction firms, supervisory firms, structural design and facility design firms, engineering firms, construction management positions, and various construction-related public institutions.</p>\n</div>\n",
                    "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_05_01_img1.png"
                },
                {
                    "course_name": "Department of Architecture Engineering",
                    "course_description": "<div id=\"architectural-engineering-department\">\n<h2>Introduction to the Department</h2>\n<p>The Department of Architectural Engineering focuses on training engineers with specialized knowledge and practical skills in various areas including architectural structure, construction and materials, architectural environment and facilities, and construction management. In 2014, the department was selected for the Local University Specialization Project to train professionals with expertise in Building Information Modeling (BIM) through specialist training programs. Consequently, our department boasts the largest building engineering lab in Busan and Gyeongsangnam-do, as well as the only BIM center in the region. We operate independent laboratories for structural analysis, structural materials, architectural environmental equipment, and architectural information management.</p>\n\n<h2>Career after graduation</h2>\n<p>Graduates of the Department of Architectural Engineering have diverse career opportunities including public officials positions, employment in construction sectors (such as Korea Land and Housing Corporation, urban construction, transportation construction, facility management corporations), construction companies, engineering offices specializing in building structures, building facilities, construction management, and quality control, as well as positions in construction materials companies.</p>\n</div>\n",
                    "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_05_02_img1.png"
                },
                {
                    "course_name": "Department of Interior Architecture",
                    "course_description": "<div id=\"interior-architecture-department\">\n<h2>Introduction to the Department</h2>\n<p>The Department of Interior Architecture at Tongmyong University focuses on teaching practical expertise ranging from design theory to construction practice. It aims to develop individual creativity and provide necessary design skills for the field. Established in 2002, the department is renowned for its systematic design education conducted through studio tutoring. Over the years, it has produced numerous graduates, achieved the highest employment rate for three consecutive years, and won three awards in various national contests. The department boasts competent faculty and talented students, fostering high satisfaction with living and learning.</p>\n\n<h2>Career after graduation</h2>\n<p>Graduates of the Department of Interior Architecture have various career opportunities including positions in interior design offices, architectural design offices, construction companies, remodeling companies, lighting companies, furniture design companies, shipbuilding design companies, building materials companies, sign design companies, environmental and public design offices, residential and apartment-related companies, station set design departments, home coordination departments, and opportunities for further education in graduate schools.</p>\n</div>\n",
                    "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_05_03_img1.png"
                },
                {
                    "course_name": "Department of Visual Design",
                    "course_description": "<div id=\"visual-design-department\">\n<h2>Introduction to the Department</h2>\n<p>The Department of Visual Design focuses on studying the basic principles of communicating ideas through visual language and influencing attitudes and behaviors through theoretical education and practice. It actively responds to the demands of various visual designs required by the rapidly developing information society and trains talented individuals who will be responsible for establishing globalization across the country.</p>\n\n<h2>Career after graduation</h2>\n<p>Graduates of the Department of Visual Design have various career opportunities including positions in advertising agencies, broadcasting stations, newspapers, PR companies, publishing companies' editing rooms, corporate design offices (public relations offices), illustrators, web designers, exhibition designers, packaging design companies, and more.</p>\n</div>\n",
                    "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_05_04_img1.png"
                }
            ]
    },
    {
            "college_name": "College of Media",
            "courses": [
                {
                    "course_name": "Department of Media and Communcation",
                    "course_description": "<div id=\"media-communication-department\">\n<h2>Introduction to the Department</h2>\n<p>The Department of Media Communication trains professionals in broadcasting, one-person media, and social media in the 4th Industrial Age. It provides hands-on training in all aspects of video production, including directing, planning, filming, editing, writing, and technical directing. Additionally, it prepares professionals to work as reporters or planners in newspapers, broadcasting and Internet media, corporate public relations offices, and cultural contents-related companies. The curriculum focuses on practical production courses and includes theoretical subjects that offer social science insights from a communication perspective to support practical skills.</p>\n\n<h2>Career after graduation</h2>\n<ul>\n<li>Newspapers, broadcasting, magazines, Internet journalism, corporate advertising, and marketing.</li>\n<li>Terrestrial, cable, satellite broadcasters, and public institutions related to policy and promotion.</li>\n<li>Broadcasting video and interactive content production/academic (graduate and overseas study).</li>\n<li>Advertising and PR agencies, interpersonal and intra-organizational communication specialists.</li>\n</ul>\n</div>\n",
                    "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_06_01_img1.png"
                },
                {
                    "course_name": "Department of Advertising and Public Relations",
                    "course_description": "<div id=\"advertising-pr-department\">\n<h2>Introduction to the Department</h2>\n<p>Advertising is an academic discipline that encompasses a wide range of social sciences, including communication, psychology, and business administration (marketing). The Advertising and Public Relations department at Tongmyong University aims to \"cultivate creative talent that can move people's minds.\" The department operates three detailed majors: online marketing communication, advertising, and PR, and provides theory-based, practical education programs to train experts in the field. To learn more about our department, please search for the advertising department on Tongmyong University's official YouTube or visit the department's official Facebook page at <a href=\"https://www.facebook.com/tuadpr\">https://www.facebook.com/tuadpr</a>.</p>\n\n<h2>Career after graduation</h2>\n<p>There are various fields where you can enter after graduation. In the field of advertising, you can choose to work as an advertising planner, copywriter, media planner, promotional or event planner at online and offline advertising agencies, or as a CM planner or CF director. In the field of public relations, you can find employment in public relations offices (or marketing departments) or PR agencies of businesses, government agencies, public institutions, or non-profit organizations. Additionally, you can work as a production and editing manager for online and offline video production companies, researchers at consumer research companies or universities, and professors at universities.</p>\n</div>\n",
                    "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_06_02_img1.png"
                },
                {
                    "course_name": "Department of Global Cultural Contents",
                    "course_description": "<div id=\"cultural-content-department\">\n<h2>Introduction to the Department</h2>\n<p>The cultural content industry, a new growth engine of the 21st century, requires development planning and production marketing personnel in various fields such as film, animation, games, storytelling, characters, festivals, theme parks, and cultural planning. This department trains cultural contents experts who meet the needs of new future industries. It focuses on creative storytelling through the development of materials from various humanities and understanding of East and West cultures, as well as the need for a deep understanding of Japanese culture and English education related to contents to match the cultural trend of the U.S. The goal is to foster the leaders of the next generation, who have extensive knowledge in theory and practice, to provide academic education based on humanities and languages (English and Japanese), and to foster global cultural talents in the field of cultural content that encompasses the digital society.</p>\n\n<h2>Career after graduation</h2>\n<p>Graduates can pursue various careers such as specialized planners, cultural content industry organizations (museums, exhibition halls, content storytellers, compositions, etc.), international business-related organizations (air carriers, hotels, travel agencies), interpreters, foreign companies, international exchanges, etc. Career paths may also include Japanese comics, games, theme parks, cultural planning, interpreters, and overseas cultural industries.</p>\n</div>\n",
                    "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_06_03_img1.png"
                }
            ]
    },
    {
        "college_name": "College of Future Multidisciplinary Studies",
        "courses": [
            {
                "course_name": "Department of Welfare Management",
                "course_description": "<div id=\"welfare-management-department\">\n<h2>Introduction to the Department</h2>\n<p>The department focuses on developing human resources specializing in welfare management, responsible for promoting the ecosystem of welfare startups and leading the shared growth of the region. It aims to cultivate startup management capabilities that understand policy trends, businesses, and future demands based on a comprehensive understanding of welfare across various fields such as children, adolescents, adults, senior citizens, and families. The program particularly addresses the challenges posed by low birth rates and aging populations by combining adult learners' know-how and knowledge to prepare students for changes in future industries and to play a major role in revitalizing the region. Field practice experiences are integral to the curriculum, providing students with practical experience in social welfare institutions, senior welfare institutions, and youth institutions.</p>\n\n<h2>Career after graduation</h2>\n<p>After graduation, students may pursue careers in various welfare-related fields. They can obtain licenses such as Social Worker Level 2, Health Family Manager, Psychological Counselor, and Multicultural Welfare Counselor. Career opportunities include working at welfare facilities for children, adolescents, women, the elderly, and the disabled, establishing and operating social welfare corporations and facility organizations, working at healthy family support centers, cooperatives, social enterprises, and serving as sharing economy startup consultants.</p>\n</div>\n",
                "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_07_01_img1.png"
            },
            {
                "course_name": "Department of Seon Meditation and Healing",
                "course_description": "<div id=\"myeongsang-healing-department\">\n<h2>Introduction to the Department</h2>\n<p>Modern psychological science is moving toward an integrated treatment of body, emotion, and mind. The Department of Myeongsang Healing provides education to identify and heal problems in everyday life that cause mental and physical pain, leading to a healthy wholeness. It aims to cultivate mental and physical healing professionals who have both theory and practice by teaching various modern meditation and natural healing techniques based on Zen meditation.</p>\n\n<h2>Career after graduation</h2>\n<p>After graduation, students may pursue careers in various fields related to mental and physical healing. They can obtain qualifications such as Mental and Physical Healing Instructor (Level 1/2), Meditation Counseling Psychologist, Meditation Counselor, Tea Ceremony Expert, and Natural Healing Expert. Career opportunities include operating mental and physical healing programs at clinical training sites in hospitals, schools, government offices, businesses, and social welfare organizations, operating meditation centers and mental and physical healing centers, and planning health coach programs.</p>\n</div>\n",
                "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_07_02_img1.png"
            },
            {
                "course_name": "Department of Eastern Cultures",
                "course_description": "<div id=\"oriental-culture-department\">\n<h2>Introduction to the Department</h2>\n<p>The department was established to reestablish Korean traditional ideas in modern science and to meet the demand for more specialized learning in the field of Oriental culture. It is a department that combines feng shui and yin yang theory, and real estate, this not only academic fundamentals and core theories in the field, but also cultivates practical skills that can be applied immediately after graduation, and enables any graduate to successfully start a business.</p>\n\n<h2>Career after graduation</h2>\n<p>After graduation, students may pursue careers in various fields related to Oriental culture. They can obtain licenses such as Pungsu Geography Instructor (Level 2, Level 1, Professional), Myeongni Consultation Instructor, Certified Broker, Appraisal Assessor, Housing Manager, etc. Career opportunities include management positions in charge of corporate and regional start-up cooperation organizations, corporations, professional feng shui consulting and feng shui interior start-up, professional Myeong-ri consulting and start-up, certified broker and real estate consulting, appraisal assessor, housing manager, etc.</p>\n</div>\n",
                "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_07_03_img1.png"
            },
            {
                "course_name": "Department of Beauty Industry",
                "course_description": "<div id=\"beauty-industry-department\">\n<h2>Introduction to the Department</h2>\n<p>While a beautiful and healthy life is emerging as an important point of view, the status of the beauty industry is increasing. The goal of education in the beauty industry department is to train \"future convergence experts who can integrate the beauty industry and the knowledge-intensive cosmetics industry based on scientific knowledge to lead the beauty industry by using functional elements of the field.\" With the goal of conducting beauty service and cosmetics-related industries and start-ups, we operate practical courses, short-term field training, and start-up connections to produce competitive, field-oriented, convergent talents.</p>\n\n<h2>Career after graduation</h2>\n<p>After graduation, students may pursue careers in various fields related to the beauty industry. They can obtain licenses such as National Makeup Certificate, Hair National Certificate, Skin National Certificate, Nail National Certificate, Customized Cosmetic Dispenser. Career opportunities include roles as education lecturers, professors, domestic and international cosmetic brand managers, cosmetics-related businesses, hair designers, spa therapists, scalp managers, makeup artists, nail artists, cosmetic companies, hotels, broadcasting stations, etc.</p>\n</div>\n",
                "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_07_04_img1.png"
            }
        ]
    },
    {
        "college_name": "College of Do-ing",
        "courses": [
            {
                "course_name": "Department of Military Service",
                "course_description": "<div id=\"military-studies-department\">\n<h2>Introduction to the Department</h2>\n<p>The Department of Military Studies at Tongmyong University is the only department in Busan and Ulsan that trains specialized military experts required by the future military. By utilizing the special characteristics of the areas where major Army, Navy, and Air Force units are located in Busan and Ulsan, we have signed agreements with each unit to provide the best educational and research conditions. The faculty consists of excellent personnel such as combat and combat support personnel, policy departments and experienced overseas personnel, and we will continue to invite competent professors to guide them closely for the future of students who will be the cornerstone of the Republic of Korea's defense. As soldiers, we provide military experience and military training to foster basic skills, and we provide customized training to develop into future professional soldiers such as military engineering and weapons systems in accordance with the Fourth Industrial Revolution.</p>\n\n<h2>Career after graduation</h2>\n<p>While attending school, you can be selected as a scholarship student for the Army, Navy, Air Force and Marine Corps (subject to military additional service support) or selected for the school corps and commissioned as an officer upon graduation. When selecting military scholarship students, the entire four-year tuition fee is paid in a lump sum, so a stable college life is possible. After graduation, you will be guaranteed status as a career soldier and a specific government official, and you, your spouse, and immediate family members will receive welfare benefits provided by the state and the military during your more than 20 years of service. In addition, after being discharged from the military, you can work at military-related research institutes such as ADD and KI DA, or as experienced military personnel, emergency planners of major companies, and experienced civil servants.</p>\n</div>\n",
                "image": "https://www.tu.ac.kr/_res/tongmyong/english/img/s03_06_04_img1.png"
            }
        ]
    }
]
  